In [1]:
seven_cnt=0
for i in range(1,100001):
    seven_cnt += str(i).count('7')
    
print(seven_cnt)

50000

In [7]:
import numpy as np
import pandas as pd

In [3]:
a=[10,20,5,1]

In [4]:
np.argmax(a)

1

In [6]:
np.argmin(a)

3

In [8]:
#pandas에서 많이 쓰이는 파일
# csv, json, xlsx, html, xml, hdf5, sas, sql

In [10]:
%%writefile sample1.csv #파일 생성
c1, c2, c3 #,를 기준으로 셀 변경
1, 1.1, one
2, 2.2, two
3, 3.3, three

Writing sample1.csv

In [13]:
pd.read_csv('sample1.csv')

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [16]:
%%writefile sample2.csv
1, 1.1, one
2, 2.2, two
3, 3.3, three

Overwriting sample2.csv

In [17]:
pd.read_csv('sample2.csv')

   1   1.1     one
0  2   2.2     two
1  3   3.3   three

In [18]:
pd.read_csv('sample2.csv', names=['c1','c2','c3']) #

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [19]:
pd.read_csv('sample1.csv')

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [20]:
pd.read_csv('sample1.csv', index_col='c1') #기존의 열 값을 인덱스로

     c2      c3
c1
1   1.1     one
2   2.2     two
3   3.3   three

In [21]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [26]:
df=pd.read_csv('sample3.txt', sep="\s+") #공백으로 셀 나누기
df

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [27]:
df.shape

(3, 4)

In [29]:
pd.read_table('sample3.txt', sep='\s+') #read_table 함수도 txt 파일 읽을 수 있음

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [30]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [37]:
pd.read_csv('sample4.txt', skiprows=[0,1]) #줄 건너뛰기

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [38]:
pd.read_csv('sample4.txt', skiprows=[1,2]) #줄 건너뛰기

       파일 제목: sample4.txt
1 1.11                one
2 2.22                two
3 3.33              three

In [61]:
%%writefile sample5.csv
c1, c2, c3
1, , one
2,모름, two
누락, 3.33, three

Overwriting sample5.csv

In [64]:
df=pd.read_csv('sample5.csv', na_values=['누락', '모름', ' ']) #NaN로 읽어져야 할 것 설정
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      2 non-null      float64
 1    c2     1 non-null      float64
 2    c3     3 non-null      object
dtypes: float64(2), object(1)
memory usage: 204.0+ bytes

In [66]:
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [68]:
df.to_csv("sample6.csv", index=False) #csv로 저장, kaggle 제출 시 index값 나오면 안되므로 False로 지정

In [69]:
df.to_csv("sample7.csv", sep='@')

In [70]:
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [71]:
df.to_csv("sample8.csv", index=False, na_rep='자료없음') #NaN 값 대신 넣을 값 설정

In [72]:
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [73]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [74]:
df.columns

Index(['c1', ' c2', ' c3'], dtype='object')

In [75]:
df.index=['a','b','c'] #index값 변경
df

    c1    c2      c3
a  1.0   NaN     one
b  2.0   NaN     two
c  NaN  3.33   three

In [76]:
df.columns=['x','y','z'] #columns값 변경
df

     x     y       z
a  1.0   NaN     one
b  2.0   NaN     two
c  NaN  3.33   three

In [79]:
df.to_csv("sample9.csv", index=False, header=False) #머리부분 제거

In [80]:
pd.read_csv('https://github.com/datablist/sample-csv-files/blob/main/files/people/people-100.csv')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 33, saw 8

In [82]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [83]:
pd.read_csv('ex1.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [84]:
pd.read_csv('ex2.csv') #header가 없음

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [85]:
pd.read_csv('ex2.csv', header=None) #header가 없음을 설정

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [88]:
pd.read_csv('ex2.csv', header=None, names=['a','b','c','d','msg']) #header의 이름을 설정

   a   b   c   d    msg
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [89]:
pd.read_csv('ex2.csv', header=None, names=['a','b','c','d','msg'], index_col='msg') #msg라는 열 데이터가 행 인덱스로 지정됨

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [94]:
pd.read_csv('csv_mindex.csv', index_col=['key2','key1'])

           value1  value2
key2 key1
a    one        1       2
b    one        3       4
c    one        5       6
d    one        7       8
a    two        9      10
b    two       11      12
c    two       13      14
d    two       15      16

In [95]:
pd.read_csv('csv_mindex.csv', index_col=['key1','key2']) #대분류 중분류 소분류로 나눠서 저장하기 위함, 멀티인덱스

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [97]:
pd.read_csv('ex3.txt',sep="\s+")

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [103]:
pd.read_csv('ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [104]:
pd.read_csv('ex4.csv', skiprows=[0,2,3]) #0,2,3번째 줄 스킵

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [111]:
df=pd.read_csv('ex5.csv')

In [112]:
df.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [113]:
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [106]:
res=pd.read_csv('ex5.csv', na_values=null)
res

NameError: name 'null' is not defined

In [ ]:
#csv에 저장된 NaN, NA, '' 데이터 값들은 read_csv로 읽었을 경우 자동으로 NaN(결측값)으로 인식됨
#'누락', '없음',... => na_values=['누락','없음',' ']와 같은 방식으로 처리

In [114]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [115]:
#json 파일 : 딕셔너리 구조

'\n{"name": "Wes",\n "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],\n "pet": null,\n "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},\n              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]\n}\n'

In [116]:
import json

In [119]:
res=json.loads(obj) #json 파일을 읽을 때 사용하는 함수
res

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [120]:
type(res)

dict

In [121]:
res.keys() #type이 딕셔너리 구조이므로 명령어 사용 가능

dict_keys(['name', 'cities_lived', 'pet', 'siblings'])

In [122]:
res.values()

dict_values(['Wes', ['Akron', 'Nashville', 'New York', 'San Francisco'], None, [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']}, {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]])

In [123]:
asjson=json.dumps(res)
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [124]:
pd.DataFrame(res['siblings'])

    name  age            hobbies
0  Scott   34  [guitars, soccer]
1  Katie   42      [diving, art]

In [125]:
pd.read_json('example.json') #json 파일을 읽을 때 loads는 문자열로 read_json은 데이터프레임 구조로 읽음

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
#####################################################################################################################################

In [126]:
import pandas as pd
#pd.Series()
from pandas import Series
#Serries
from pandas import Series as ser #권장하지 않음

In [127]:
Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [128]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index) #data=data, index=index가 생략
print(s)

철수    100
영희    200
아름    300
dtype: int64

In [129]:
score = [100, 200, 300]
name = ["철수", "영희", "아름"]
s = Series(data=score, index=name) #속성명 속성값
print(s)

철수    100
영희    200
아름    300
dtype: int64

In [130]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data) #데이터 값만 들어가고 인덱스는 임의로 0, 1, 2라고 지정
s.index = index #인덱스에 인덱스라는 변수의 값으로 지정
print(s)

철수    100
영희    200
아름    300
dtype: int64

In [131]:
score = {
    "철수": 100,
    "영희": 200,
    "아름": 300
}

s = Series(score)

In [134]:
s #딕셔너리 구조를 시리즈로 실행하면 키값이 인덱스로 밸류값이 데이터로 지정

철수    100
영희    200
아름    300
dtype: int64

In [137]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [138]:
s.index

Index(['철수', '영희', '아름'], dtype='object')

In [140]:
s.values

array([100, 200, 300], dtype=int64)

In [141]:
s.to_dict() #series를 dictionary로 변경

{'철수': 100, '영희': 200, '아름': 300}

In [145]:
s.to_excel('mydata.xlsx', header=False) #excel 저장 하기

In [147]:
pd.read_excel('mydata.xlsx', header=None) #excel 파일 읽기

    0    1
0  철수  100
1  영희  200
2  아름  300

In [149]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [150]:
s.dtype #series인 s의 안에 있는 데이터의 타입
type(s) #s의 타입

dtype('int64')

In [151]:
data = [  10,  "가" ] #숫자와 문자가 섞여있으면 시리즈로 변하는 과정에서 숫자도 문자로 변환
s = Series( data )
s

0    10
1     가
dtype: object

In [153]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [155]:
s.index.dtype #index의 type가 Object, 문자라는 뜻

dtype('O')

In [156]:
import pandas as pd

data = {"apple": 1500, "banana": 3000}
s = pd.Series(data)
s

apple     1500
banana    3000
dtype: int64

In [157]:
s.to_dict()

{'apple': 1500, 'banana': 3000}

In [158]:
s = pd.Series(['1', '2', '3'])
s

0    1
1    2
2    3
dtype: object

In [161]:
int(s[0])+40

41

In [162]:
s.astype('int64') #문자로 된 숫자를 int, float으로 변화가능

0    1
1    2
2    3
dtype: int64

In [177]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [169]:
s['영수']=400

In [170]:
s

철수    100
영희    200
아름    300
영수    400
dtype: int64

In [171]:
del s['철수']

In [172]:
s

영희    200
아름    300
영수    400
dtype: int64

In [175]:
s.drop('영수', inplace=True)

In [176]:
s

영희    200
아름    300
dtype: int64

In [178]:
s

철수    100
영희    200
아름    300
dtype: int64

In [180]:
s=s.iloc[1:] #철수가 제거된 것과 동일

In [181]:
s

영희    200
아름    300
dtype: int64

In [182]:
s = pd.Series(
    data = [9000, 9000, 8000, 9000, 10000],
    index = ['김과장', '이대리', '박전무', '이대리', '이대리']
)
s

김과장     9000
이대리     9000
박전무     8000
이대리     9000
이대리    10000
dtype: int64

In [186]:
s.unique()

array([ 9000,  8000, 10000], dtype=int64)

In [187]:
s.index.unique()

Index(['김과장', '이대리', '박전무'], dtype='object')

In [188]:
s = pd.Series(
    data = [9000, 9000, 8000, 9000, 10000],
    index = ['김과장', '이대리', '박전무', '이대리', '이대리']
)
s

김과장     9000
이대리     9000
박전무     8000
이대리     9000
이대리    10000
dtype: int64

In [189]:
s.value_counts()

9000     3
8000     1
10000    1
dtype: int64

In [190]:
s.index.value_counts()

이대리    3
김과장    1
박전무    1
dtype: int64

In [191]:
data = {
    "삼성전자": "전기,전자",
    "LG전자": "전기,전자",
    "현대차": "운수장비",
    "NAVER": "서비스업",
    "카카오": "서비스업"
}
s = Series(data)
s

삼성전자     전기,전자
LG전자     전기,전자
현대차       운수장비
NAVER     서비스업
카카오       서비스업
dtype: object

In [193]:
s.value_counts()

전기,전자    2
서비스업     2
운수장비     1
dtype: int64

In [194]:
data = [100, 300, 200]
index = ["08/01", "08/02", "08/03"]
s = Series(data, index)
s

08/01    100
08/02    300
08/03    200
dtype: int64

In [195]:
s.iloc[[0,2]]

08/01    100
08/03    200
dtype: int64

In [196]:
import numpy as np

data = np.random.randint(10, size=4)
s = Series(data)
s

0    3
1    0
2    4
3    5
dtype: int32

In [197]:
s.sort_values()

1    0
0    3
2    4
3    5
dtype: int32

In [198]:
s.sort_values(ascending=False)

3    5
2    4
0    3
1    0
dtype: int32

In [199]:
s.sort_index()

0    3
1    0
2    4
3    5
dtype: int32

In [200]:
data = [100, 300, 200]
s = Series(data)
s

0    100
1    300
2    200
dtype: int64

In [201]:
s+100

0    200
1    400
2    300
dtype: int64

In [206]:
high = Series(data=[51500, 51200, 52500], index=["5/3", "5/2", "5/1"])
low = Series(data=[50700, 50500, 50500], index=["5/1", "5/2", "5/4"])

In [208]:
high

5/3    51500
5/2    51200
5/1    52500
dtype: int64

In [209]:
low

5/1    50700
5/2    50500
5/4    50500
dtype: int64

In [207]:
high-low

5/1    1800.0
5/2     700.0
5/3       NaN
5/4       NaN
dtype: float64

In [211]:
s = Series(data=[51500, 51200, 52500], index=["5/1", "5/2", "5/3"])
s

5/1    51500
5/2    51200
5/3    52500
dtype: int64

In [213]:
s[s>=51700]

5/3    52500
dtype: int64

In [214]:
s[(s>=51300) & (s<=53000)]

5/1    51500
5/3    52500
dtype: int64

In [216]:
sum((s>=51300) & (s<=53000)) #True는 1 False는 0 이므로 조건에 만족하는 값의 갯수 출력

2

In [218]:
len(s[(s>=51300) & (s<=53000)])

2

In [219]:
from pandas import Series 

data = {
    "2020-12-11": 73400,
    "2020-12-10": 72900,
    "2020-12-09": 73900,
    "2020-12-08": 71700,
    "2020-12-07": 72900
}

s = Series(data)
s

2020-12-11    73400
2020-12-10    72900
2020-12-09    73900
2020-12-08    71700
2020-12-07    72900
dtype: int64

In [220]:
s.sum()

364800

In [221]:
s.mean()

72960.0

In [222]:
s.product() #int64의 범위를 벗어남

-6514723640420366336

In [223]:
s=s.astype('float64')
s

2020-12-11    73400.0
2020-12-10    72900.0
2020-12-09    73900.0
2020-12-08    71700.0
2020-12-07    72900.0
dtype: float64

In [224]:
s.product() #모든 데이터 값의 곱

2.06687737175922e+24

In [225]:
data = [1, 2, 3, 4, np.nan]
s = Series(data=data)
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [226]:
s.isna()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [231]:
sum(s.isna())
s.isna().sum()

1

In [230]:
len(s[s.isna()])

1

In [232]:
s.notna()

0     True
1     True
2     True
3     True
4    False
dtype: bool

In [233]:
s.notna().sum()

4

In [234]:
data = ["100,000", "200,000", "300,000"]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100,000
영희    200,000
아름    300,000
dtype: object

In [248]:

s.apply(lambda x:int(x.replace(',',''))+100000)

철수    200000
영희    300000
아름    400000
dtype: int64

In [249]:
#시리즈에 저장되어 있는 문자열에 대해 특정 연산 수행하고자 한다면
s.str.replace(',','')
#시리즈.str.문자열함수()

철수    100000
영희    200000
아름    300000
dtype: object

In [264]:
s = pd.Series([1, 2, 3], index=['2023-01-01', '2023-01-02', '2023-01-03'])
s

2023-01-01    1
2023-01-02    2
2023-01-03    3
dtype: int64

In [267]:
s.index.str[5:]

Index(['01-01', '01-02', '01-03'], dtype='object')

In [ ]:
"""
타이타닉 -> 이름 -> 모든 호칭(Mr., Mrs, Miss 등) 추출
"""